Repository: ulsdevteam/pkp-formHoneypot
Catalog: locale/*/locale.po
Languages: de, es, it, nb, nl, sv

# plugins.generic.formHoneypot.displayName
source: Form Honeypot Plugin
de: Honeypot-Formular-Plugin
es: Módulo de formulario Honeypot
it: Plugin Modulo Honeypot
nl: Formulier Honeypot Plugin

# plugins.generic.formHoneypot.description
source: This plugin will add a field on the user registration form and use it as a honeypot. This field will be hidden from users and an error will be presented if a bot fills out the field. You may also select a minimum and maximum time to allow for form completion. For example, if a bot completes the form in under 2 seconds or tries to use the same form 30 minutes (1800 seconds) later, the registration can be blocked.
de: Das Plugin ergänzt ein Feld zu dem Registrierungsformular und nutzt es als "Honeypot".Das Feld ist für Nutzende nicht sichtbar und gibt einen Fehler aus, wenn ein Bot das Feld ausfüllt.Es kann auch eine Minimal- und Maximalzeit festgelegt werden, um das Registrierungsformular auszufüllen.Zum Beispiel, wenn ein Bot das Formular in unter 2 Sekunden oder das Formular nach 30 Minuten (1800) später wieder ausfüllt, wird die Registrierung blockiert.
es: Este módulo convierte uno de los campos del formulario de registro de usuario en un honeypot. El campo escogido se esconderá a los usuarios normales, de manera que, cuando un robot lo complete, se mostrará un error. Puede configurar el tiempo mínimo y máximo para completar el formulario. Por ejemplo, si un robot completa el forumlario en 2 segundos o intenta utilizar el mismo formulario 30 minutos (1800 segundos) más tarde, el registro puede bloquearse.
it: Questo plugin aggiunge un campo nel modulo di registrazione dei nuovi utenti e lo usa come honeypot. Questo campo viene nascosto agli utenti e viene presentato un errore se un bot lo compila. Puoi anche selezionare un tempo minimo e massimo per la compilazione del modulo. Ad esempio, se un bot compila il modulo in meno di 2 secondi o prova a usare il modulo 30 minuti (1800 secondi) dopo, la registrazione può essere bloccata.
nb: Dette programtillegget vil legge til et felt på brukerregistreringsskjemaet og bruke det som en honeypot. Dette feltet blir skjult for brukere, og en feil vil bli presentert hvis en bot fyller ut feltet. Du kan også velge en minimums- og maksimaltid for utfylling av skjema. Hvis for eksempel en bot fyller ut skjemaet på under 2 sekunder eller prøver å bruke samme skjema 30 minutter (1800 sekunder) senere, kan registreringen blokkeres.
nl: Deze plugin voegt een verborgen veld toe aan het registratieformulier, dat gebruikt wordt als "lokveld". Dit veld wordt niet getoond op de website en mag niet worden ingevuld. Wanneer een bot het veld invult, wordt een foutmelding getoond. U kunt ook een minimum en maximum tijd instellen voor het invullen van het registratieformulier. Bijvoorbeeld, wanneer een bot het formulier in minder dan 2 seconden invult, of hetzelfde formulier 30 minuten (1800 seconden) later wil gebruiken, kan de registratie worden geblokkeerd.
sv: Denna insticksmodul lägger till ett fält i användarregistreringsformuläret och använder det som en honungsfälla. Fältet är dolt för användare och ett fel visas om det fylls i av en bot. Du kan också välja en minimum- och maximumtid för ifyllning av formuläret. Om till exempel en bot fyller i formuläret på två sekunder och försöker använda samma formulär 30 minuter (1800 sekunder) senare, kan registreringen blockeras.

# plugins.generic.formHoneypot.leaveBlank
source: Leave this blank
de: Lassen Sie dieses Feld leer.
es: Dejar en blanco
it: Lasciare vuoto
nb: La dette stå tomt
nl: Laat leeg
sv: Lämna detta fält tomt

# plugins.generic.formHoneypot.doNotUseThisField
source: This field must be left blank: {$element}
de: Dieses Feld muss leer bleiben: {$element}
es: Este campo debe dejarse en blanco: {$element}
it: Questo campo deve essere lasciato vuoto: {$element}
nb: Dette feltet må stå tomt: {$element}
nl: Dit veld moet leeg blijven: {$element}
sv: Det här fältet måste vara tomt: {$element}

# plugins.generic.formHoneypot.invalidSessionTime
source: Your registration has been blocked.
de: Ihre Registrierung wurde gesperrt.
es: Petición de registro bloqueada.
it: La tua registrazione è stata bloccata.
nb: Din registrering har blitt blokkert.
nl: Uw registratiepoging is geblokkeerd.
sv: Din registrering har blivit blockerad.

# plugins.generic.formHoneypot.manager.formHoneypotSettings
source: Form Honeypot Settings
de: Honeypot-Formular-Einstellungen
es: Configuración del formulario Honeypot
it: Impostazioni Modulo Honeypot
nb: Form Honeypot innstillinger
nl: Formulier Honeypot instellingen
sv: Form Honeypot inställningar

# plugins.generic.formHoneypot.manager.settings.description
source: Choose a minimum time and a maximum time, in seconds. Registration attempts that are completed faster than the minimum time or slower than the maximum time are rejected. You may disable this feature by setting both limits to 0.
de: Wählen Sie eine Mindestzeit und eine Maximalzeit in Sekunden aus. Registrierungsversuche, die schneller als die Mindestzeit oder langsamer als die Höchstzeit abgeschlossen sind, werden abgelehnt. Sie können diese Funktion deaktivieren, indem Sie beide Werte auf 0 setzen.
es: Escoge el campo del formulario de registro de usuario que quieres convertir en un Honeypot para robots. Este campo se esconderá a los usuarios normales (mediante javascript), pero los bots lo seguirán viendo e intentarán completarlo. Si se completase, generaría un error de registro. El campo seguirá estando disponible en el perfil para los usuarios una vez registrados.
it: Scegli un tempo minimo e uno massimo, in secondi. Tentativi di reistrazione che vengono completati in meno del tempo minimo o più del tempo massimo vengono rigettati. Puoi disabilitare questa funzione indicando 0 per entrambi i limiti.
nb: Velg en minimumstid og en maksimal tid, i sekunder. Registreringsforsøk som gjennomføres raskere enn minstetid eller saktere enn maksimal tid, blir avvist. Du kan deaktivere denne funksjonen ved å sette begge grensene til 0.
nl: Kies een minimum en maximum tijd, in seconden. Registratiepogingen die sneller dan de minimumtijd worden voltooid, of trager dan de maximumtijd, worden geblokkeerd. U kunt deze instellingen uitschakelen door 0 in te vullen als waarde.
sv: Välj en minimumtid och en maximumtid, i sekunder. Registreringsförsök som görs snabbare än minimumtiden eller långsammare än maximumtiden blir avvisade. Du kan avvaktivera denna funktion genom att sätta bägge gränserna till 0.

# plugins.generic.formHoneypot.manager.settings.element
source: Form Element
de: Formularelement
es: Elemento de formulario
it: Elemento del modulo
nb: Skjemaelement
nl: Formulier-element
sv: Formulärfält

# plugins.generic.formHoneypot.manager.settings.createNewElement
source: Create a new element
de: Erstelle ein neues Element
es: Crear un nuevo elemento
it: Crea un nuovo elemento
nb: Lag et nytt element
nl: CreÃ«er een nieuw element
sv: Skapa ett nytt fält

# plugins.generic.formHoneypot.manager.settings.minimumTime
source: Minimum time (in seconds)
de: Mindestzeit (in Sekunden)
es: Tiempo mínimo (en segundos)
it: Tempo minimo (in secondi)
nb: Minimumstid (i sekunder)
nl: Minimumtijd (in seconden)
sv: Minimumtid (i sekunder)

# plugins.generic.formHoneypot.manager.settings.minimumTimeNumber
source: Minimum time must be a positive numeric value.
de: Die Mindestzeit muss ein positiver Wert sein.
es: El tiempo mínimo, debe ser un número positivo.
it: Tempo minimo deve essere un valore numerico positivo.
nb: Minimumstid må være en positiv numerisk verdi.
nl: Minimumtijd moet een postitief getal zijn.
sv: Minimumtid måste vara ett positivt tal

# plugins.generic.formHoneypot.manager.settings.maximumTime
source: Maximum time (in seconds)
de: Maximalzeit (in Sekunden)
es: Tiempo máximo (en segundos)
it: Tempo massimo (in secondi)
nb: Maksimumstid (i sekunder)
nl: Maximumtijd (in seconden)
sv: Maximumtid (i sekunder)

# plugins.generic.formHoneypot.manager.settings.maximumTimeNumber
source: Maximum time must be a positive numeric value.
de: Die Maximalzeit muss ein positiver Wert sein.
es: El tiempo máximo debe ser un número positivo.
it: Tempo massimo deve essere un valore numerico positivo.
nb: Maksimumstid må være en positiv numerisk verdi.
nl: Maximumtijd moet een postitief getal zijn.
sv: Maximumtid måste vara ett positivt tal.
